loadtest/artilleryio.drivertest.yml
config:
  target: "http://localhost:5002"
  socketio:
    transports: ["websocket"]
  processor: "./artilleryiofunctions.js"
  phases: # 5 users every second for 3 seconds
    - duration: 3
      arrivalRate: 1

scenarios:
  - name: My Socketio test
    engine: "socketio"
    flow:
      - function: "login"
      - emit:
          namespace: "/drivers"
          channel: "authenticate"
          data:
            token: "{{ token }}"

      - function: "setupData"
      - emit:
          namespace: "/drivers"
          channel: "delivery_start"
          data: 
            packages: "{{ packages }}"
      - loop:
        - function: "getCoordinate"
        - emit:
            namespace: "/drivers"
            channel: "new_coordinates"
            data:
              coordinate: "{{ coordinate }}"
        - think: 3
        count: 100